Revit 2026 API

# OffsetSurface Methods

---

The OffsetSurface type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from Surface) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBasisSurface | Returns a copy of basis surface of this OffsetSurface. |
|  | GetBoundingBoxUV | Gets the UV bounding box of the surface. (Inherited from Surface) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetOffsetDistance | Returns offset distance of this OffsetSurface. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsOrientationSameAsBasisSurface | Indicates whether the orientation of the OffsetSurface is same as that of its basis surface, in the sense that their oriented normals at any (u, v) have the same direction. |
|  | Project | Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails. (Inherited from Surface) |
|  | ProjectWithGuessPoint | Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails. (Inherited from Surface) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

OffsetSurface Class

Autodesk.Revit.DB Namespace